In [1]:
import random
import pandas as pd
import string

Autopassword Generate using python

In [2]:
numbers = ['0','1','2','3','4','5','6','7','8','9']
small_characters = ['a','b','c','d','e','f','g','h','i','j','k','l','m','n','o','p','q','r','s','t','u','v','w','x','y','z']
capital_characters=['A','B','C','D','E','I','F','G','H','I','J','K','L','M','N','O','P','Q','R','S','T','U','V','W','X','Y','Z']
symbols = ['@', '#', '$', '%', '=', ':', '?', '.', '/', '|', '~', '>',  '*', '(', ')']

In [3]:
fixed_password = numbers+small_characters+capital_characters+symbols

In [4]:
random_password = random.choice(numbers)+random.choice(small_characters)+random.choice(capital_characters)+random.choice(symbols)

In [5]:
max_length = 12
emp_password = []
for k in range(5):
    password = fixed_password+list(random.choice(random_password))
    list_password = list(password)
    final_password = ''.join(random.choice(list_password) for j in range(max_length))
    emp_password.append(final_password)

In [6]:
emp_password

['0EJSBACgU#hy',
 '=4YkIRc>gvHd',
 '7o?P=A#RfU46',
 'Bv1/Xft*GqMN',
 '6S8cIHB%RUwy']

In [7]:
password = {'password' :emp_password }

In [8]:
df1 = pd.DataFrame(password)

In [9]:
df1

       password
0  0EJSBACgU#hy
1  =4YkIRc>gvHd
2  7o?P=A#RfU46
3  Bv1/Xft*GqMN
4  6S8cIHB%RUwy

In [10]:
d1 = df1
d1

       password
0  0EJSBACgU#hy
1  =4YkIRc>gvHd
2  7o?P=A#RfU46
3  Bv1/Xft*GqMN
4  6S8cIHB%RUwy

Dynamic dataset generate

In [13]:
df2 = pd.DataFrame(columns=['Name','Age','Gender','Experience','salary'])


for i in range(5):
    name = input('Enter name: ')
    age = int(input('Enter Age: ')) 
    gen = input('Enter Gender F/M : ')
    exp = float(input('Enter Experience: '))
    sal = int(input('Enter salary per month :'))
    df2.loc[i,'Name']=name
    df2.loc[i,'Age']=age
    df2.loc[i,'Gender']=gen
    df2.loc[i,'Experience']=exp
    df2.loc[i,'salary']=sal

Enter name: Mina
Enter Age: 34
Enter Gender F/M : F
Enter Experience: 3
Enter salary per month :30000
Enter name: Monisha
Enter Age: 34
Enter Gender F/M : F
Enter Experience: 4
Enter salary per month :50000
Enter name: manish
Enter Age: 34
Enter Gender F/M : M
Enter Experience: 2
Enter salary per month :30000
Enter name: Mohan
Enter Age: 30
Enter Gender F/M : M
Enter Experience: 3
Enter salary per month :40000
Enter name: Miraaz
Enter Age: 29
Enter Gender F/M : M
Enter Experience: 3
Enter salary per month :40000

In [14]:
d2 = df2
d2

      Name Age Gender Experience salary
0     Mina  34      F          3  30000
1  Monisha  34      F          4  50000
2   manish  34      M          2  30000
3    Mohan  30      M          3  40000
4   Miraaz  29      M          3  40000

In [30]:
#task 3 : concat both dataframe
emp_dataset = pd.concat([d2,d1],axis=1)
emp_dataset

      Name Age Gender Experience salary      password
0     Mina  34      F          3  30000  0EJSBACgU#hy
1  Monisha  34      F          4  50000  =4YkIRc>gvHd
2   manish  34      M          2  30000  7o?P=A#RfU46
3    Mohan  30      M          3  40000  Bv1/Xft*GqMN
4   Miraaz  29      M          3  40000  6S8cIHB%RUwy

In [25]:
#convert into csv
emp_dataset.to_csv('emp_dataframe.csv')

In [29]:
#read_csv
df = pd.read_csv('emp_dataframe.csv')
df

   Unnamed: 0     Name  Age Gender  Experience  salary      password
0           0     Mina   34      F         3.0   30000  0EJSBACgU#hy
1           1  Monisha   34      F         4.0   50000  =4YkIRc>gvHd
2           2   manish   34      M         2.0   30000  7o?P=A#RfU46
3           3    Mohan   30      M         3.0   40000  Bv1/Xft*GqMN
4           4   Miraaz   29      M         3.0   40000  6S8cIHB%RUwy